<script>
    export default {
        name: "HomePage",
        data() {
            return {
                name: "HomePage"
            };
        }
    };
</script>

<template>
    <div>
        <h1 class="text-center">Welcome to {{name}}</h1>
        <section>
            <h3>Завдання</h3>
            <p>Створити веб-застосунок (ASP.NET Core MVC), що задовольнятиме наступним вимогам.</p>

            <ol>
                <li>
                    Складається з двох проектів:
                    <ul>
                        <li>Безпосередньо веб додаток</li>
                        <li>Бібліотека класів, що дає змогу запускати практичні 1, 2 або 3</li>
                    </ul>
                </li>
                <li>Розгортання виконати на операційній системі Linux (Ubuntu/Debian) за допомогою віртуальної машини</li>
                <li>
                    Має наступний інтерфейс:
                    <ul>
                        <li>Сторінка вітання з описом роботи</li>
                        <li>Сторінка логіну, реєстрації та профілю користувача</li>
                        <li>Три сторінки для кожної підпрограми з полями для введення і виведення та описом того, що робить підпрограма</li>
                        <li>Доступ до сторінок з підпрограмами можливий тільки після авторизації</li>
                    </ul>
                </li>
                <li>
                    Сторінка реєстрації має дозволяти ввести, щонайменше наступні поля:
                    <ul>
                        <li>Ім'я користувача (50 символів, унікальне)</li>
                        <li>ФІО (500 символів)</li>
                        <li>Пароль та підтвердження паролю (не менше 8 і не більше 16 символів, містить хоча б одну цифру, один знак, одну велику літеру)</li>
                        <li>Телефон (український формат)</li>
                        <li>Електронна адреса (RFC 822)</li>
                    </ul>
                </li>
                <li>Сторінка профілю не має можливості редагування і тільки відображає інформацію, введену при реєстрації</li>
                <li>
                    Для авторизації і аутентифікації слід використати сервер, що реалізує OAuth2:
                    <ul>
                        <li><a href="https://identityserver4.readthedocs.io/en/latest/">IdentityServer4</a></li>
                        <li><a href="https://www.okta.com/pricing/#customer-identity-products">Okta</a> (безкоштовна версія для розробників)</li>
                        <li>Google Identity або інші сервіси, що реалізують OAuth2</li>
                    </ul>
                </li>
                <li>Під час захисту потрібно показати розгорнуті віртуальні машини, сервер авторизації та що локальні налаштування працюють.</li>
                <li>Всі скрипти та команди, необхідні для розгортання застосунку, слід додати до репозиторію.</li>
            </ol>
        </section>
    </div>
</template>
